Revit 2027 API
FabricationPart.Create Method
Overload List
Name | Description
Create(Document, FabricationItemFile, ElementId) |  Creates a fabrication part element from a fabrication item file.
Create(Document, FabricationServiceButton, Int32, ElementId) |  Creates a fabrication part element based on button.
Create(Document, FabricationServiceButton, Double, Double, ElementId) |  Creates a fabrication part element based on button and size.
Top
See Also
Reference
FabricationPart Class
Autodesk.Revit.DB Namespace